docs/blog/musturbating.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Stop Musturbating</title>
<meta name="author" content="Tak" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='/css/stylesheet.css'>
</head>
<body>
<div id="nav" class="status">
<a href='/'>bacchanalian madness</a> / <a href='/rss'>rss</a> / <label id='dark-mode-button'> <input type='checkbox'> </label>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Stop Musturbating</h1>
</header><div class="note" id="org753c961">
<p>This is an excerpt from the third chapter of the book "Feeling Good" by Dr. David D. Burns.
</p>

</div>

<p>Statements such as "I <i>should</i> do this" or "I <i>must</i> do this" when used for motivation leads to one feeling pressured or resentful. By trying to motivate oneself in this way, one ends up feeling apathetic and unmotivated, this phenomenon is called "musturbation" by Albert Ellis.
</p>

<p>These statements generate a lot of unnecessary emotional turmoil in one's daily life leading to self-loathing, shame or guilt. When other people fall short of expectations, one feels bitter and self-righteous.
</p>

<p>Change expectations to approximate reality, stop <i>musturbating</i>.
</p>
<div id="outline-container-orgc3ffad0" class="outline-2">
<h2 id="orgc3ffad0">Cognititive Distortions</h2>
<div class="outline-text-2" id="text-orgc3ffad0">
<ol class="org-ol">
<li><p><i>All-or-Nothing</i> Thinking
</p>

<p>It forms the basis for perfectionism, causing one to fear any mistake or imperfection to avoid seeing oneself as a loser, or feeling inadequate or worthless.
</p></li>

<li><p><i>Overgeneralization</i>
</p>

<p>Seeing a single negative event as a never-ending pattern of defeat. The pain of rejection is generated almost entirely from overgeneralization. In its absence, a personal affront is temporarily disappointing but <i>cannot</i> be seriously disturbing.
</p></li>

<li><p><i>Mental Filter</i>
</p>

<p>When one's depressed, one wears a pair of eyeglasses with special lenses that filter out anything positive, allowing only the negative to enter the conscious mind.
</p></li>

<li><p><i>Disqualifying the Positive</i>
</p>

<p>A spectacular mental illusion is the persistent tendency to transform neutral or positive experiences into negative ones. An example of this is defending the negative thoughts or disqualifying one's compliment as insincere.
</p></li>

<li><p><i>Jumping to Conclusions</i>
</p>

<p>Making the assumption that other people are looking down on you and being so convinced of the fact that one doesn't even bother verifying it. This self-defeating behavior of imagining negative scenarios might act as a self-fulfilling prophecy and can set one up for negative interactions when none exists.
</p></li>

<li><p><i>Binocular Trick</i>
</p>

<p>When one's blowing things out of proportion or shrinking them; Magnifying when looking at own errors, fears or imperfections and exaggerating their importance; Minimizing when thinking about one's strengths to make them seem small and unimportant leading to feelings of inferiority.
</p></li>

<li><p><i>Emotional Reasoning</i>
</p>

<p>Taking the emotions as evidence for truth. "Because I feel like something, I <i>am</i> that". This reasoning is misleading because one's feelings reflect thoughts and beliefs (when distorted) that might be invalid. Never let the negative feelings guide your actions.
</p></li>

<li><p><i>Should Statements</i>
</p>

<p>Stop "musturbating".
</p></li>

<li><p><i>Labeling and Mislabeling</i>
</p>

<p>Personal labeling such as <i>"I'm a&#x2026;"</i> leads to creating a completely negative self-image based on errors. It's an extreme form of overgeneralization. And mislabeling other people with inaccurate and emotionally loaded words can generate hostility.
</p></li>

<li><p><i>Personalization</i>
</p>

<p>Assuming responsibility for a negative without any basis for doing so. Arbitrarily conculding that the circumstances were one's fault or reflected one's inadequacy, even when one's not responsible for them, leading to crippling guilt. Confusing <i>influence</i> with <i>control</i>.
</p></li>
</ol>
</div>
</div>
</div>
<footer id="postamble" class="status">
&copy; 2026 . Made with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 31.0.50 (<a href="https://orgmode.org">Org</a> mode 9.7.11).
</footer>
</body>
</html>
